james35022000/SmartDorm_ARM/STM32F4_EVB-WJ-D2032/Project/SmartDorm_Main/inc/main.h
/**
  ******************************************************************************
  * @file    Project/STM32F4_EVB_Demo/main.h 
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    18-March-2013
  * @brief   Header for main.c module
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"
#include "stm32f4x7_eth_bsp.h"
#include "stdbool.h"
#include "tm_stm32f4_rtc.h"
#include "netconf.h"
#include "string.h"

#if defined (USE_STM324xG_EVAL)
	#include "stm324xg_eval.h"
	#include "stm324xg_eval_lcd.h"
#elif defined (USE_STM324x7I_EVAL) 
	#include "stm324x7i_eval.h"
	#include "stm324x7i_eval_lcd.h"
#elif defined (USE_STM32F4_EVB)
	#include "stm32f4_evb.h"
	#include "stm32f4_evb_audio_codec.h"
	#include "STM32f4_evb_fsmc_psram.h"
	#include "stm32f4_evb_i2c_ee.h"
	#include "stm32f4_evb_i2c_gsensor.h"
	#include "stm32f4_evb_i2c_tsc.h"
//	#include "stm32f4_evb_lcd.h"
  #include "stm324xg_eval_lcd.h"
	#include "stm32f4_evb_sdio_sd.h"
#else
	#error "Please select first the Evaluation board used in your application (in Project Options)"
#endif

/*  DEBUG MODE  */
#define DEBUG

/*  MAIN CONNECTION BY  */
//#define USE_BLE
#define USE_INTERNET

/*  WCS_AUTH BY  */
#define WCS_AUTH_BLE
//#define WCS_AUTH_INTERNET




#define USE_LCD        /* enable LCD  */  
//#define USE_DHCP       /* enable DHCP, if disabled static address is used */
   
#define DEST_IP_ADDR0   192
#define DEST_IP_ADDR1   168
#define DEST_IP_ADDR2   0
#define DEST_IP_ADDR3   11

#define DEST_PORT       7

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0   2
#define MAC_ADDR1   0
#define MAC_ADDR2   0
#define MAC_ADDR3   0
#define MAC_ADDR4   0
#define MAC_ADDR5   0
 
/*Static IP ADDRESS: IP_ADDR0.IP_ADDR1.IP_ADDR2.IP_ADDR3 */
#define IP_ADDR0   192
#define IP_ADDR1   168
#define IP_ADDR2   1
#define IP_ADDR3   203
   
/*NETMASK*/
#define NETMASK_ADDR0   255
#define NETMASK_ADDR1   255
#define NETMASK_ADDR2   255
#define NETMASK_ADDR3   0

/*Gateway Address*/
#define GW_ADDR0   192
#define GW_ADDR1   168
#define GW_ADDR2   1
#define GW_ADDR3   1

/* MII and RMII mode selection, for STM324xG-EVAL Board(MB786) RevB ***********/
//#define RMII_MODE  // User have to provide the 50 MHz clock by soldering a 50 MHz
                     // oscillator (ref SM7745HEV-50.0M or equivalent) on the U3
                     // footprint located under CN3 and also removing jumper on JP5. 
                     // This oscillator is not provided with the board. 
                     // For more details, please refer to STM3240G-EVAL evaluation
                     // board User manual (UM1461).

                                     
#define MII_MODE

/* Uncomment the define below to clock the PHY from external 25MHz crystal (only for MII mode) */
#ifdef 	MII_MODE
 #define PHY_CLOCK_MCO
#endif

/* STM324xG-EVAL jumpers setting
    +==========================================================================================+
    +  Jumper |       MII mode configuration            |      RMII mode configuration         +
    +==========================================================================================+
    +  JP5    | 2-3 provide 25MHz clock by MCO(PA8)     |  Not fitted                          +
    +         | 1-2 provide 25MHz clock by ext. Crystal |                                      +
    + -----------------------------------------------------------------------------------------+
    +  JP6    |          2-3                            |  1-2                                 +
    + -----------------------------------------------------------------------------------------+
    +  JP8    |          Open                           |  Close                               +
    +==========================================================================================+
  */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void TimingDelay_Decrement(void);
void Time_Update(void);
void Delay(__IO uint32_t nTime);
void Clockinit(void);
void LEDinit(void);
void Timinit(void);
void DistanceSensorinit(void);
void BTinit(void);
void setTime(void);
double DistanceSenser(void);
void TIM2_IRQHandler(void);
bool runCommand(int);
bool isCommand(char[]);
void USART2_SendData(char*);
void printUartData(void);
void getUartData(void);
void USART2_IRQHandler(void);
void WCS_Update_func(void);
void WCS_Lineup_func(void);
void WCS_auth(void);
struct WashingClothesServer* WCS_Exist(char[]);
void WCS_Finished(void);
bool if_time_more_than(const char[], const char[]);
void time_add(char[], const int);
int monthGetDate(int);
/* Global variables */
extern bool welFlag;

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
